HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEray_reg.h
/** \\brief  3C0, Message Buffer Status Changed Interrupt Control 3 */
#define ERAY0_MSIC3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MSIC3*)0xF001C3C0u)

/** Alias (User Manual Name) for ERAY0_MSIC3.
* To use register names with standard convension, please use ERAY0_MSIC3.
*/
#define	ERAY_MSIC3	(ERAY0_MSIC3)

/** \\brief  3C4, Message Buffer Status Changed Interrupt Control 4 */
#define ERAY0_MSIC4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MSIC4*)0xF001C3C4u)

/** Alias (User Manual Name) for ERAY0_MSIC4.
* To use register names with standard convension, please use ERAY0_MSIC4.
*/
#define	ERAY_MSIC4	(ERAY0_MSIC4)

/** \\brief  114, Macrotick and Cycle Counter Value */
#define ERAY0_MTCCV /*lint --e(923)*/ (*(volatile Ifx_ERAY_MTCCV*)0xF001C114u)

/** Alias (User Manual Name) for ERAY0_MTCCV.
* To use register names with standard convension, please use ERAY0_MTCCV.
*/
#define	ERAY_MTCCV	(ERAY0_MTCCV)

/** \\brief  330, New Data Register 1 */
#define ERAY0_NDAT1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDAT1*)0xF001C330u)

/** Alias (User Manual Name) for ERAY0_NDAT1.
* To use register names with standard convension, please use ERAY0_NDAT1.
*/
#define	ERAY_NDAT1	(ERAY0_NDAT1)

/** \\brief  334, New Data Register 2 */
#define ERAY0_NDAT2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDAT2*)0xF001C334u)

/** Alias (User Manual Name) for ERAY0_NDAT2.
* To use register names with standard convension, please use ERAY0_NDAT2.
*/
#define	ERAY_NDAT2	(ERAY0_NDAT2)

/** \\brief  338, New Data Register 3 */
#define ERAY0_NDAT3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDAT3*)0xF001C338u)

/** Alias (User Manual Name) for ERAY0_NDAT3.
* To use register names with standard convension, please use ERAY0_NDAT3.
*/
#define	ERAY_NDAT3	(ERAY0_NDAT3)

/** \\brief  33C, New Data Register 4 */
#define ERAY0_NDAT4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDAT4*)0xF001C33Cu)

/** Alias (User Manual Name) for ERAY0_NDAT4.
* To use register names with standard convension, please use ERAY0_NDAT4.
*/
#define	ERAY_NDAT4	(ERAY0_NDAT4)

/** \\brief  3A8, New Data Interrupt Control 1 */
#define ERAY0_NDIC1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDIC1*)0xF001C3A8u)

/** Alias (User Manual Name) for ERAY0_NDIC1.
* To use register names with standard convension, please use ERAY0_NDIC1.
*/
#define	ERAY_NDIC1	(ERAY0_NDIC1)

/** \\brief  3AC, New Data Interrupt Control 2 */
#define ERAY0_NDIC2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDIC2*)0xF001C3ACu)

/** Alias (User Manual Name) for ERAY0_NDIC2.
* To use register names with standard convension, please use ERAY0_NDIC2.
*/
#define	ERAY_NDIC2	(ERAY0_NDIC2)

/** \\brief  3B0, New Data Interrupt Control 3 */
#define ERAY0_NDIC3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDIC3*)0xF001C3B0u)

/** Alias (User Manual Name) for ERAY0_NDIC3.
* To use register names with standard convension, please use ERAY0_NDIC3.
*/
#define	ERAY_NDIC3	(ERAY0_NDIC3)

/** \\brief  3B4, New Data Interrupt Control 4 */
#define ERAY0_NDIC4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NDIC4*)0xF001C3B4u)

/** Alias (User Manual Name) for ERAY0_NDIC4.
* To use register names with standard convension, please use ERAY0_NDIC4.
*/
#define	ERAY_NDIC4	(ERAY0_NDIC4)

/** \\brief  8C, NEM Configuration Register */
#define ERAY0_NEMC /*lint --e(923)*/ (*(volatile Ifx_ERAY_NEMC*)0xF001C08Cu)

/** Alias (User Manual Name) for ERAY0_NEMC.
* To use register names with standard convension, please use ERAY0_NEMC.
*/
#define	ERAY_NEMC	(ERAY0_NEMC)

/** \\brief  1B0, Network Management Vector \note Array index shifted by 1.
 * Example: defined register NMV_1S[0]/NMV_1S0 corresponds to user manual
 * NMV_1S1, ... */
#define ERAY0_NMV_1S0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NMV*)0xF001C1B0u)

/** Alias (User Manual Name) for ERAY0_NMV_1S0.
* To use register names with standard convension, please use ERAY0_NMV_1S0.
*/
#define	ERAY_NMV1	(ERAY0_NMV_1S0)

/** \\brief  1B4, Network Management Vector \note Array index shifted by 1.
 * Example: defined register NMV_1S[0]/NMV_1S0 corresponds to user manual
 * NMV_1S1, ... */
#define ERAY0_NMV_1S1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NMV*)0xF001C1B4u)

/** Alias (User Manual Name) for ERAY0_NMV_1S1.
* To use register names with standard convension, please use ERAY0_NMV_1S1.
*/
#define	ERAY_NMV2	(ERAY0_NMV_1S1)

/** \\brief  1B8, Network Management Vector \note Array index shifted by 1.
 * Example: defined register NMV_1S[0]/NMV_1S0 corresponds to user manual
 * NMV_1S1, ... */
#define ERAY0_NMV_1S2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_NMV*)0xF001C1B8u)

/** Alias (User Manual Name) for ERAY0_NMV_1S2.
* To use register names with standard convension, please use ERAY0_NMV_1S2.
*/
#define	ERAY_NMV3	(ERAY0_NMV_1S2)

/** \\brief  710, Output Buffer Command Mask */
#define ERAY0_OBCM /*lint --e(923)*/ (*(volatile Ifx_ERAY_OBCM*)0xF001C710u)

/** Alias (User Manual Name) for ERAY0_OBCM.
* To use register names with standard convension, please use ERAY0_OBCM.
*/
#define	ERAY_OBCM	(ERAY0_OBCM)

/** \\brief  714, Output Buffer Command Request */
#define ERAY0_OBCR /*lint --e(923)*/ (*(volatile Ifx_ERAY_OBCR*)0xF001C714u)

/** Alias (User Manual Name) for ERAY0_OBCR.
* To use register names with standard convension, please use ERAY0_OBCR.
*/
#define	ERAY_OBCR	(ERAY0_OBCR)

/** \\brief  8E8, OCDS Control and Status */
#define ERAY0_OCS /*lint --e(923)*/ (*(volatile Ifx_ERAY_OCS*)0xF001C8E8u)

/** Alias (User Manual Name) for ERAY0_OCS.
* To use register names with standard convension, please use ERAY0_OCS.
*/
#define	ERAY_OCS	(ERAY0_OCS)

/** \\brief  11C, Offset Correction Value */
#define ERAY0_OCV /*lint --e(923)*/ (*(volatile Ifx_ERAY_OCV*)0xF001C11Cu)

/** Alias (User Manual Name) for ERAY0_OCV.
* To use register names with standard convension, please use ERAY0_OCV.
*/
#define	ERAY_OCV	(ERAY0_OCV)

/** \\brief  170, Odd Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register OSID_1S[0]/OSID_1S0 corresponds to user manual
 * OSID_1S1, ... */
#define ERAY0_OSID_1S0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_OSID*)0xF001C170u)

