HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEray_reg.h
/** Alias (User Manual Name) for ERAY0_OTSS.
* To use register names with standard convension, please use ERAY0_OTSS.
*/
#define	ERAY_OTSS	(ERAY0_OTSS)

/** \\brief  90, PRT Configuration Register 1 */
#define ERAY0_PRTC1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_PRTC1*)0xF001C090u)

/** Alias (User Manual Name) for ERAY0_PRTC1.
* To use register names with standard convension, please use ERAY0_PRTC1.
*/
#define	ERAY_PRTC1	(ERAY0_PRTC1)

/** \\brief  94, PRT Configuration Register 2 */
#define ERAY0_PRTC2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_PRTC2*)0xF001C094u)

/** Alias (User Manual Name) for ERAY0_PRTC2.
* To use register names with standard convension, please use ERAY0_PRTC2.
*/
#define	ERAY_PRTC2	(ERAY0_PRTC2)

/** \\brief  118, Rate Correction Value */
#define ERAY0_RCV /*lint --e(923)*/ (*(volatile Ifx_ERAY_RCV*)0xF001C118u)

/** Alias (User Manual Name) for ERAY0_RCV.
* To use register names with standard convension, please use ERAY0_RCV.
*/
#define	ERAY_RCV	(ERAY0_RCV)

/** \\brief  600, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY0_RDDS_1S0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C600u)

/** Alias (User Manual Name) for ERAY0_RDDS_1S0.
* To use register names with standard convension, please use ERAY0_RDDS_1S0.
*/
#define	ERAY_RDDS01	(ERAY0_RDDS_1S0)

/** \\brief  604, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY0_RDDS_1S1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C604u)

/** Alias (User Manual Name) for ERAY0_RDDS_1S1.
* To use register names with standard convension, please use ERAY0_RDDS_1S1.
*/
#define	ERAY_RDDS02	(ERAY0_RDDS_1S1)

/** \\brief  628, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY0_RDDS_1S10 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C628u)

/** Alias (User Manual Name) for ERAY0_RDDS_1S10.
* To use register names with standard convension, please use ERAY0_RDDS_1S10.
*/
#define	ERAY_RDDS11	(ERAY0_RDDS_1S10)

/** \\brief  62C, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY0_RDDS_1S11 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C62Cu)

/** Alias (User Manual Name) for ERAY0_RDDS_1S11.
* To use register names with standard convension, please use ERAY0_RDDS_1S11.
*/
#define	ERAY_RDDS12	(ERAY0_RDDS_1S11)

/** \\brief  630, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY0_RDDS_1S12 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C630u)

/** Alias (User Manual Name) for ERAY0_RDDS_1S12.
* To use register names with standard convension, please use ERAY0_RDDS_1S12.
*/
#define	ERAY_RDDS13	(ERAY0_RDDS_1S12)

/** \\brief  634, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY0_RDDS_1S13 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C634u)

/** Alias (User Manual Name) for ERAY0_RDDS_1S13.
* To use register names with standard convension, please use ERAY0_RDDS_1S13.
*/
#define	ERAY_RDDS14	(ERAY0_RDDS_1S13)

/** \\brief  638, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY0_RDDS_1S14 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C638u)

/** Alias (User Manual Name) for ERAY0_RDDS_1S14.
* To use register names with standard convension, please use ERAY0_RDDS_1S14.
*/
#define	ERAY_RDDS15	(ERAY0_RDDS_1S14)

/** \\brief  63C, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY0_RDDS_1S15 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C63Cu)

/** Alias (User Manual Name) for ERAY0_RDDS_1S15.
* To use register names with standard convension, please use ERAY0_RDDS_1S15.
*/
#define	ERAY_RDDS16	(ERAY0_RDDS_1S15)

/** \\brief  640, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY0_RDDS_1S16 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C640u)

/** Alias (User Manual Name) for ERAY0_RDDS_1S16.
* To use register names with standard convension, please use ERAY0_RDDS_1S16.
*/
#define	ERAY_RDDS17	(ERAY0_RDDS_1S16)

/** \\brief  644, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY0_RDDS_1S17 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C644u)

/** Alias (User Manual Name) for ERAY0_RDDS_1S17.
* To use register names with standard convension, please use ERAY0_RDDS_1S17.
*/
#define	ERAY_RDDS18	(ERAY0_RDDS_1S17)

/** \\brief  648, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY0_RDDS_1S18 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C648u)

/** Alias (User Manual Name) for ERAY0_RDDS_1S18.
* To use register names with standard convension, please use ERAY0_RDDS_1S18.
*/
#define	ERAY_RDDS19	(ERAY0_RDDS_1S18)

/** \\brief  64C, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY0_RDDS_1S19 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C64Cu)

/** Alias (User Manual Name) for ERAY0_RDDS_1S19.
* To use register names with standard convension, please use ERAY0_RDDS_1S19.
*/
#define	ERAY_RDDS20	(ERAY0_RDDS_1S19)

/** \\brief  608, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY0_RDDS_1S2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C608u)

/** Alias (User Manual Name) for ERAY0_RDDS_1S2.
* To use register names with standard convension, please use ERAY0_RDDS_1S2.
*/
#define	ERAY_RDDS03	(ERAY0_RDDS_1S2)

/** \\brief  650, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY0_RDDS_1S20 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C650u)

/** Alias (User Manual Name) for ERAY0_RDDS_1S20.
* To use register names with standard convension, please use ERAY0_RDDS_1S20.
*/
#define	ERAY_RDDS21	(ERAY0_RDDS_1S20)

/** \\brief  654, Read Data Section \note Array index shifted by 1. Example:
 * defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
#define ERAY0_RDDS_1S21 /*lint --e(923)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C654u)

/** Alias (User Manual Name) for ERAY0_RDDS_1S21.
* To use register names with standard convension, please use ERAY0_RDDS_1S21.
*/
#define	ERAY_RDDS22	(ERAY0_RDDS_1S21)

